DB_NAME = 'quiz_bot.db'

CORRECT_PHRASES = [
    'Отличный ход!',
    'Это было хорошо!',
    'Поразительно!',
    'Потрясающе!',
    'Действительно,',
    'Ну а что ещё, если не',
    'Согласен,',
    'Верно,',
    'Верно!',
    'Лучший ответ:',
    'Не поспоришь:',
    'С тобой трудно спорить:',
    'Ну да,',
    'Правильно!',
    'Хорошо!',
    'Тут победа!',
    'Есть контакт!',
]

PRE_WRONG_PHRASE = 'Ваш ответ:'

WRONG_PHRASES = [
    'Отказано.',
    'Неверно!',
    'Ну, нет.',
    'Позор!',
    'Иногда лучше вообще ничего не отвечать...',
    'Эту ошибку придётся вспоминать перед сном...',
    'Поражение.',
    'Вы погибли.',
    'Это невыносимо...',
    'Невиданный промах!',
    'Это всё ваше ЕГЭ...',
    'Нет, но ничего страшного (:',
    'Не-а.',
    'Почти...',
    'Похоже, я тебя переоценил.',
    'Разочарование.',
    'Ты молодец, никого не слушай. Даже меня.',
]

UNHANDLED_MESSAGES_PHRASES = [
    'Не зли меня.',
    'Ты давай не умничай.',
    'Угу.',
    '🙄',
    'Извините, не очень понял ваше сообщение. Выберите один из вариантов.',
    'Не понял ваше сообщение',
]

EMOJI_WRONG = '❌'
EMOJI_CORRECT = '✅'
