quiz_data = [
    {
        'question': '1. Что такое Некрономикон?',
        'options': ['Статья, посвящённая умершему', 'Книга Мёртвых', 'Маг, взаимодействующий с миром мёртвых', 'Музыкальный инструмент'],
        'correct_option': 1
    },
    {
        'question': '2. Как называется игра, где нужно объяснять слова, не используя однокоренные?',
        'options': ['Крокодил', 'Бункер', 'Элиас', 'Свинтус'],
        'correct_option': 2
    },
    {
        'question': '3. Кто не является актёром 6 кадров?',
        'options': ['Сергей Нитиевский', 'Ирина Медведева', 'Эдуард Радзюкевич', 'Андрей Кайков'],
        'correct_option': 0
    },
    {
        'question': '4. Вы спасли девушку от маньяка в лесу, что можно попросить в качестве благодарности?',
        'options': ['Покажи дорогу до города', 'Я сделал это не ради выгоды.', 'Давай познакомимся', 'Пойдём, корову подержишь'],
        'correct_option': 3
    },
    {
        'question': '5. Какого грейда не существует?',
        'options': ['enjoyer', 'middle', 'intern', 'senior'],
        'correct_option': 0
    },
    {
        'question': '6. Какие цвета чаще всего не различают люди с дальтонизмом?',
        'options': ['Синий и жёлтый', 'Все цвета', 'Красный и зелёный', 'Оранжевый и розовый'],
        'correct_option': 2
    },
    {
        'question': '7. Жанр/поджанр компьютерных игр, в котором смерть является важной частью обучения?',
        'options': ['Rouge-like', 'Action/RPG', 'Slasher', 'Souls-like'],
        'correct_option': 3
    },
    {
        'question': '8. Итак, Ваше число?',
        'options': ['5', '3', '7', '9', '8'],
        'correct_option': 4
    },
    {
        'question': '9. Мировоззрение, согласно которому все события в жизни предопределены и неизбежны. Человек не способен изменить свою судьбу, и любые попытки изменить судьбу бесполезны?',
        'options': ['Агностицизм', 'Эмпиризм', 'Фатализм', 'Эйблизм'],
        'correct_option': 2
    },
    {
        'question': '10. Как зовут медведя из Смешариков?',
        'options': ['Крошич', 'Хорошич', 'Нюшатыч', 'Копатыч'],
        'correct_option': 3
    },
]